[
  {
    "cluster_id": 0,
    "name": "the, upon, milestone",
    "size": 8,
    "sentences": [
      "Lead Time: The completed skid shall be delivered to the site within 12 weeks from the date of Purchase Order (PO) issuance.",
      "Design Phase: All engineering drawings to be completed within 3 weeks.",
      "Liquidated Damages: $1,000 per day for every day past the 12-week delivery mark.",
      "Inspection: 10% Radiographic Testing (RT) on all butt welds.",
      "Payments shall be made against the following milestones (Net 30 days):",
      "Milestone 1: 20% upon PO issuance and Project Kick-off.",
      "Milestone 2: 40% upon completion of fabrication and inspection.",
      "Milestone 3: 50% upon final delivery and acceptance at site."
    ]
  },
  {
    "cluster_id": 1,
    "name": "week, pressure, design",
    "size": 17,
    "sentences": [
      "Process design and P&ID development.",
      "Factory Acceptance Testing (FAT) at the Contractor's facility.",
      "Final shipping and offloading at the Site.",
      "Fluid: Gaseous Hydrogen (99.9% purity)",
      "Operating Temperature: -10°C to 60°C.",
      "Design Pressure: 75 barg.",
      "Design Factor: 1.5x Operating Pressure.",
      "1.  Final P&ID and General Arrangement (GA) Drawings.",
      "2.  ASME Pressure Vessel Calculations.",
      "3.  Weld Procedure Specifications (WPS).",
      "4.  Data Sheet specifying a Design Pressure of 90 barg.",
      "Milestone, Duration (Weeks), Cumulative Week",
      "Kick-off Meeting, 1, Week 1",
      "Material Procurement, 6, Week 7",
      "Fabrication & Assembly, 6, Week 13",
      "FAT & Shipping, 3, Week 16",
      "END OF DOCUMENT"
    ]
  },
  {
    "cluster_id": 2,
    "name": "the, to, scope includes",
    "size": 2,
    "sentences": [
      "The scope includes, but is not limited to:",
      "The physical boundaries of the Contractor's work are defined as follows:"
    ]
  },
  {
    "cluster_id": 3,
    "name": "to, the, window",
    "size": 1,
    "sentences": [
      "To meet the facility shutdown window, the project must adhere to a strict timeline."
    ]
  },
  {
    "cluster_id": 4,
    "name": "the, and, system",
    "size": 10,
    "sentences": [
      "The Contractor shall provide all labor, materials, and equipment for the engineering, procurement, fabrication, and testing of one (1) Hydrogen Injection Skid. The goal of this project is to provide high-pressure hydrogen enrichment to the main turbine feed line.",
      "Installation of all mechanical and electrical tie-ins to the existing facility header (Line 100-H-05).",
      "The equipment shall be designed to meet the following process parameters:",
      "Materials of Construction: SS316L (Stainless Steel) for all wetted parts to prevent hydrogen embrittlement.",
      "Exclusions: The Contractor is responsible for fabrication and delivery only. All tie-ins, inter-connecting piping, and site integration are excluded from the Contractor's scope and shall be performed by the Owner's site team.",
      "The following documentation must be submitted for approval:",
      "Primary Code: The system shall be designed and stamped in accordance with ASME Section VIII, Division 1.",
      "Regional Standards: All components must strictly comply with Eurocode 3 and the Pressure Equipment Directive (PED).",
      "Piping: All process piping shall be Carbon Steel (A106-B) to ensure compatibility with site-wide standards.",
      "Coating: Multi-coat epoxy system, Color: Safety Blue."
    ]
  },
  {
    "cluster_id": 5,
    "name": "valves, valve, the",
    "size": 3,
    "sentences": [
      "Inlet: Upstream of the automated isolation valve V-101.",
      "Outlet: Downstream of the final discharge check valve CV-205.",
      "Valves: All valves must be 316 Stainless Steel with PTFE seats."
    ]
  },
  {
    "cluster_id": 6,
    "name": "sow me, sow, revision 02",
    "size": 1,
    "sentences": [
      "Document ID: SOW-ME-788-A Revision: 02 Date: October 24, 2025"
    ]
  },
  {
    "cluster_id": 7,
    "name": "structural steel, structural, steel fabrication",
    "size": 1,
    "sentences": [
      "Structural steel fabrication and skid coating."
    ]
  }
]